{
    "content": [
        {
            "title": "SSR FrontEnd",
            "empresa": "Banco Hipotecario",
            "fecha": {
                "inicio": "Sep 2025",
                "fin": "Actualidad"
            },
            "tareas": [
               "Contribuí al desarrollo y armado de la aplicación móvil principal del banco, que actualmente está en fase de implementación y crecimiento.",
               "Desarrollé e implementé nuevas funcionalidades transaccionales y de autogestión.",
               "Resolví bugs críticos y ejecuté un mantenimiento preventivo, mejorando continuamente el rendimiento y la estabilidad de la aplicación.",
               "Coordiné técnicamente con otros equipos, liderando decisiones de producto y asegurando la alineación tecnológica global."
            ]
        },
        {
            "title": "React Native Developer",
            "empresa": "ItRocks",
            "fecha": {
                "inicio": "Dic 2024",
                "fin": "Sep 2025"
            },
            "tareas": [
                "Lideré el diseño e implementación de la arquitectura base del proyecto en React Native, asegurando escalabilidad y rendimiento óptimo.",
                "Desarrollé funcionalidades clave para la app principal, integrando soluciones con el backend (Node.js) y cumpliendo los requerimientos de negocio.",
                "Resolví bugs críticos y ejecuté un mantenimiento preventivo, mejorando continuamente el rendimiento y la estabilidad de la aplicación.",
                "Coordiné técnicamente con otros equipos, liderando decisiones de producto y asegurando la alineación tecnológica global."
            ]
        },
        {
            "title": "React Native Developer",
            "empresa": "GlobalNews",
            "fecha": {
                "inicio": "Abril 2023",
                "fin": "Marzo 2025"
            },
            "tareas": [
                "Contribuí al armado inicial de la arquitectura mobile y desarrollé vistas y componentes reutilizables, acelerando el time-to-market.",
                "Corregí errores reportados por QA y usuarios finales, implementando mejoras UI/UX en colaboración con el equipo de diseño. ",
                "Aporté soluciones técnicas alineadas al modelo de negocio de medios digitales, manteniendo la funcionalidad y actualizando librerías de la app."
            ]
        },
        {
            "title": "Desarrollador Full Stack",
            "empresa": "Startup - Magnetico",
            "fecha": {
                "inicio": "Jul-2024",
                "fin": "Oct-2024"
            },
            "tareas": [
                "Participé en el desarrollo de un sistema de gestión de pedidos utilizando Next.js y NestJS.",
                "Implementé un flujo para controlar y asignar pedidos a diferentes empresas, permitiendo una asignación automática basada en la cotización creada por cada empresa.",
                "Desarrollé la lógica que permitía a las empresas crear cotizaciones personalizadas por cada tecnología solicitada por el cliente.",
                "Mejoré la eficiencia del proceso de cotización y asignación, optimizando el tiempo de respuesta entre la solicitud del cliente y la asignación de la empresa.",
                "Contribuí a la integración de microservicios y a la escalabilidad del sistema."
            ]
        },
        {
            "title": "Jr React Native Developer",
            "empresa": "IUTRACE",
            "fecha": {
                "inicio": "Feb-2022",
                "fin": "Abr-2023"
            },
            "tareas": [
                "Comencé en el equipo mobile como developer Jr., participando en tareas de mantenimiento y corrección de bugs de la app principal.",
                "Con el tiempo, tomé responsabilidades más técnicas: creación de componentes reutilizables, mejoras de rendimiento y adaptación de pantallas a distintos dispositivos.",
                "Implementé flujos completos usando React Native y TypeScript, integrando servicios REST y GraphQL.",
                "Trabajé en la migración de parte del código de JavaScript a TypeScript, mejorando la calidad del proyecto y reduciendo errores en producción.",
                "Colaboré con el equipo de backend para definir contratos de APIs y manejar flujos de autenticación y notificaciones push.",
                "Participé en sprints ágiles, aportando en refinamientos y proponiendo mejoras en UI/UX.",
                "Contribuí a mejorar la documentación interna y procesos de testing automatizado usando herramientas como Jest y Detox.",
                "Finalicé el último año como referente técnico dentro del equipo mobile (sin rol formal de liderazgo), aportando en la toma de decisiones técnicas y revisión de PRs."
            ]
        }
    ]
}


