{
    "content": [
        {
            "title": "React Native Developer",
            "empresa": "ItRocks",
            "fecha": {
                "inicio": "Dic 2024",
                "fin": "Actualidad"
            },
            "tareas": [
                "Diseño y armado de la arquitectura base del proyecto en React Native",
                "Desarrollo de funcionalidades clave para la app principal de la empresa",
                "Resolución de bugs críticos y mejora continua del rendimiento",
                "Mantenimiento preventivo y evolutivo de la aplicación.",
                "Desarrollo de soluciones integradas con el backend (Node.js) según los requerimientos del negocio.",
                "Coordinación técnica con otros equipos y liderazgo en decisiones de producto."
            ]
        },
        {
            "title": "React Native Developer",
            "empresa": "GlobalNews",
            "fecha": {
                "inicio": "Abril 2023",
                "fin": "Marzo 2025"
            },
            "tareas": [
                "Participación en el armado inicial de la arquitectura mobile.",
                "Desarrollo de vistas y componentes reutilizables en React Native.",
                "Corrección de errores reportados por QA y usuarios finales.",
                "Implementación de mejoras UI/UX junto con el equipo de diseño.",
                "Mantenimiento funcional de la app y actualización de librerías.",
                "Aportar soluciones técnicas alineadas al modelo de negocio de medios digitales."
            ]
        },
        {
            "title": "Desarrollador Full Stack",
            "empresa": "Startup - Magnetico",
            "fecha": {
                "inicio": "Jul-2024",
                "fin": "Oct-2024"
            },
            "tareas": [
                "Participé en el desarrollo de un sistema de gestión de pedidos utilizando Next.js y NestJS.",
                "Implementé un flujo para controlar y asignar pedidos a diferentes empresas, permitiendo una asignación automática basada en la cotización creada por cada empresa.",
                "Desarrollé la lógica que permitía a las empresas crear cotizaciones personalizadas por cada tecnología solicitada por el cliente.",
                "Mejoré la eficiencia del proceso de cotización y asignación, optimizando el tiempo de respuesta entre la solicitud del cliente y la asignación de la empresa.",
                "Contribuí a la integración de microservicios y a la escalabilidad del sistema."
            ]
        },
        {
            "title": "Jr React Native Developer",
            "empresa": "IUTRACE",
            "fecha": {
                "inicio": "Feb-2022",
                "fin": "Abr-2023"
            },
            "tareas": [
                "Comencé en el equipo mobile como developer Jr., participando en tareas de mantenimiento y corrección de bugs de la app principal.",
                "Con el tiempo, tomé responsabilidades más técnicas: creación de componentes reutilizables, mejoras de rendimiento y adaptación de pantallas a distintos dispositivos.",
                "Implementé flujos completos usando React Native y TypeScript, integrando servicios REST y GraphQL.",
                "Trabajé en la migración de parte del código de JavaScript a TypeScript, mejorando la calidad del proyecto y reduciendo errores en producción.",
                "Colaboré con el equipo de backend para definir contratos de APIs y manejar flujos de autenticación y notificaciones push.",
                "Participé en sprints ágiles, aportando en refinamientos y proponiendo mejoras en UI/UX.",
                "Contribuí a mejorar la documentación interna y procesos de testing automatizado usando herramientas como Jest y Detox.",
                "Finalicé el último año como referente técnico dentro del equipo mobile (sin rol formal de liderazgo), aportando en la toma de decisiones técnicas y revisión de PRs."
            ]
        }
    ]
}